// 11. Напишите программу, которая выводит случайное
// трехзначное число и удаляет вторую цифру этого числа.

// 456 -> 46
// 782 -> 72
// 918 -> 98

int [] array = new [array] Random().Next(100, 1000);
Console.WriteLine(array {0},{2});